[
    {
        "name": "Hội Xuân Núi Bà",
        "dates": "4 tháng 1 - 16 tháng 1",
        "description": "Núi Bà Đen là ngọn núi nằm ở trung tâm tỉnh Tây Ninh, Việt Nam. Với độ cao 986 m, đây là ngọn núi cao nhất miền Nam Việt Nam hiện nay, được mệnh danh \"Đệ nhất thiên sơn\".[2][3]",
        "dynasties": [],
        "events": []
    },
    {
        "name": "Hội Đống Đa",
        "dates": "5 tháng 1",
        "description": "Gò Đống Đa là một gò đất và là một di tích nằm bên phố Tây Sơn, phường Quang Trung, quận Đống Đa, Thành phố Hà Nội. Tại đây năm 1789 quân Tây Sơn đã đại phá và đánh thắng quân nhà Thanh Trung Quốc trong Trận Ngọc Hồi - Đống Đa.",
        "dynasties": [],
        "events": []
    },
    {
        "name": "Hội Liễu Đôi",
        "dates": "5 tháng 1",
        "description": "",
        "dynasties": [],
        "events": []
    },
    {
        "name": "Hội đền Hai Bà Trưng",
        "dates": "6 tháng 1 - 10 tháng 1",
        "description": "Đền Hai Bà Trưng còn gọi là đền Hạ Lôi ở thôn Hạ Lôi xã Mê Linh, huyện Mê Linh, thành phố Hà Nội[3][4]. Đền thờ hai vị liệt nữ - anh hùng dân tộc là Trưng Trắc và Trưng Nhị.",
        "dynasties": [],
        "events": []
    },
    {
        "name": "Hội Chùa Hương",
        "dates": "6 tháng 1 đến hạ tuần tháng 3",
        "description": "Chùa Hương là cách nói trong dân gian, trên thực tế chùa Hương hay Hương Sơn là cả một quần thể văn hóa - tôn giáo Việt Nam, gồm hàng chục ngôi chùa thờ Phật, vài ngôi đền thờ thần, các ngôi đình, thờ tín ngưỡng nông nghiệp. Trung tâm chùa Hương nằm ở xã Hương Sơn, huyện Mỹ Đức, Hà Nội, nằm ở ven bờ phải sông Đáy. Trung tâm của cụm đền chùa tại vùng này chính là chùa Hương nằm trong động Hương Tích hay còn gọi là chùa Trong.",
        "dynasties": [],
        "events": []
    },
    {
        "name": "Hội Chùa Đậu",
        "dates": "8 tháng 1 - 10 tháng 1",
        "description": "Chùa Đậu (tên chữ: Thành Đạo tự 成道寺) là một ngôi chùa ở thôn Gia Phúc, xã Nguyễn Trãi, huyện Thường Tín, Hà Nội. Vì chùa thờ Bà Đậu hay Đại Bồ Tát Pháp Vũ nên chùa được gọi là chùa Đậu và còn có tên là Pháp Vũ tự.",
        "dynasties": [],
        "events": []
    },
    {
        "name": "Lễ hội đua Voi",
        "dates": "Một ngày trong tháng 3",
        "description": "Lễ hội đua voi là một trong những lễ hội quan trọng trong hệ thống các lễ hội cổ truyền của người vùng cao Tây Nguyên Việt Nam. Hội Đua Voi là một trong những hội của văn hóa truyền thống các dân tộc tỉnh Đắk Lắk được tổ chức 02 năm 01 lần vào tháng 3 âm lịch. Là Tháng của những con ong rừng đi lấy mật và cũng là thời điểm bắt đầu làm nương rẫy. Hội Đua Voi nhằm tôn vinh tinh thần thượng võ và tài nghệ thuần dưỡng voi của đồng bào các dân tộc Tây Nguyên.Ngoài ra, du khách đến đây cũng được thưởng thức ẩm thực độc đáo, đậm đà bản sắc của các dân tộc Tây Nguyên tại chỗ và được cưỡi voi tham quan buôn làng, trải nghiệm với hành trình cưỡi Voi lội sông Sêrêpốk tham quan Rừng Yok Don. Được tổ chức ở vùng Đắk Lắk. Một trong những lễ hội được xem là độc đáo nhất của nước Việt Nam ta.",
        "dynasties": [],
        "events": []
    },
    {
        "name": "Hội Lim",
        "dates": "13 tháng 1",
        "description": "Hội Lim là một lễ hội lớn của tỉnh Bắc Ninh, chính hội được tổ chức vào ngày 13 tháng giêng (âm lịch) hàng năm, trên địa bàn huyện Tiên Du tỉnh Bắc Ninh. Hội Lim được coi là nét kết tinh độc đáo của vùng văn hoá Kinh Bắc .",
        "dynasties": [],
        "events": []
    },
    {
        "name": "Hội Côn Sơn",
        "dates": "16 tháng 1 - 22 tháng 1",
        "description": "Chùa Côn Sơn (tên chữ là Tư Phúc tự hay Côn Sơn Tự), còn gọi là chùa Hun, là một ngôi chùa nằm bên ngọn núi Côn Sơn (hay còn gọi là núi Hun) ở phường Cộng Hoà, thành phố Chí Linh, tỉnh Hải Dương, Việt Nam. Chùa đã được Bộ trưởng Bộ Văn hóa Việt Nam Dân chủ cộng hòa xếp hạng di tích quốc gia ngay trong đợt I năm 1962[4]. Đây là di tích quan trọng thuộc khu di tích Côn Sơn - Kiếp Bạc được công nhận là di tích quốc gia đặc biệt năm 2012.[5]",
        "dynasties": [],
        "events": []
    },
    {
        "name": "Hội Phủ Dầy",
        "dates": "1 tháng 3 - 9 tháng 3",
        "description": "Phủ Dầy (có khi ghi là Phủ Giầy, Phủ Giày) là một quần thể kiến trúc tín ngưỡng truyền thống của người Việt trải rộng trên địa bàn xã Kim Thái huyện Vụ Bản, tỉnh Nam Định, gần quốc lộ 10, quốc lộ 37B và quốc lộ 38B từ thành phố Nam Định đi thành phố Ninh Bình.",
        "dynasties": [],
        "events": []
    },
    {
        "name": "Hội đền Thờ Hai Bà Trưng",
        "dates": "4 tháng 3 - 6 tháng 3",
        "description": "",
        "dynasties": [],
        "events": []
    },
    {
        "name": "Hội Chùa Thầy",
        "dates": "5 tháng 3 - 7 tháng 3",
        "description": "Chùa Thầy là một nhóm những ngôi chùa ở chân núi Sài Sơn, huyện Quốc Oai, tỉnh Hà Tây cũ, nay là xã Sài Sơn, huyện Quốc Oai, Hà Nội, cách trung tâm Hà Nội khoảng 20 km về phía Tây nam, đi theo đường cao tốc Láng - Hòa Lạc. Sài Sơn có tên Nôm là núi Thầy, nên chùa được gọi là chùa Thầy. Chùa được xây dựng từ thời nhà Lý. Đây từng là nơi tu hành của Thiền sư Từ Đạo Hạnh, lúc này núi Thầy còn gọi là núi Phật Tích.",
        "dynasties": [],
        "events": []
    },
    {
        "name": "Hội Chùa Tây Phương",
        "dates": "6 tháng 3 đến hết 8 tháng 3",
        "description": "Chùa Tây Phương (tên chữ là Sùng Phúc tự 崇福寺) là một ngôi chùa được xây trên đỉnh đồi Câu Lậu ở thôn Yên, xã Thạch Xá, huyện Thạch Thất, thành phố Hà Nội.",
        "dynasties": [],
        "events": []
    },
    {
        "name": "Lễ hội Hoa Lư",
        "dates": "8 tháng 3 - 11 tháng 3",
        "description": "Lễ hội Hoa Lư là một lễ hội truyền thống diễn ra hàng năm để tôn vinh vị anh hùng dân tộc Đinh Bộ Lĩnh đã xây dựng kinh đô Hoa Lư, lập ra nhà nước Đại Cồ Việt và mở đầu thời kỳ độc lập, thống nhất lâu dài của người Việt suốt các triều đại Đinh, Lê, Lý, Trần. Lễ hội Hoa Lư đã được xếp hạng là di sản văn hóa cấp quốc gia và đang được đề nghị nâng tầm tổ chức lễ hội theo nghi thức cấp nhà nước.[1] Lễ hội Hoa Lư là lễ hội đã có lịch sử lâu đời, phản ánh đậm nét, sinh động về cuộc đời, thân thế và sự nghiệp của đức vua Đinh Tiên Hoàng và lịch sử Việt Nam qua ba triều đại Đinh, Lê, Lý. Lễ hội Hoa Lư xưa được các vương triều phong kiến tổ chức trang trọng ở cấp Nhà nước. Hiện nay, lễ hội Hoa Lư vẫn là lễ hội có tầm ảnh hưởng lớn, bảo lưu được những yếu tố văn hóa, văn nghệ dân gian đặc sắc và đang hướng tới nâng cấp thành quốc lễ.",
        "dynasties": [],
        "events": []
    },
    {
        "name": "Lễ hội Gò Tháp",
        "dates": "14,15,16 tháng 3 - 14,15,16 tháng 11",
        "description": "Khu di tích Gò Tháp là một di tích quốc gia đặc biệt, nằm trên địa bàn hai xã Mỹ Hòa và Tân Kiều, huyện Tháp Mười, tỉnh Đồng Tháp, cách Mỹ An (huyện lỵ) khoảng 11 km về hướng Bắc, cách Thành phố Cao Lãnh về hướng đông bắc 43 km (theo đường bộ và đường thủy).",
        "dynasties": [],
        "events": []
    },
    {
        "name": "Giỗ Tổ Hùng Vương",
        "dates": "10 tháng 3",
        "description": "Ngày giỗ Tổ Hùng Vương hoặc Lễ hội Đền Hùng hoặc Quốc giỗ là một ngày lễ của Việt Nam. Đây là ngày hội truyền thống của Người Việt tưởng nhớ công lao dựng nước của Hùng Vương[1]. Nghi lễ truyền thống được tổ chức hàng năm vào mùng 10 tháng 3 Âm lịch tại Đền Hùng, thành phố Việt Trì, tỉnh Phú Thọ và được người dân Việt Nam trên toàn thế giới kỷ niệm và tôn kính. Tín ngưỡng thờ cúng Hùng Vương đã được Bộ Văn hóa, Thể thao và Du lịch Việt Nam ghi danh vào Danh mục di sản văn hóa phi vật thể quốc gia (đợt 1) và UNESCO công nhận là Di sản văn hóa phi vật thể.",
        "dynasties": [],
        "events": []
    },
    {
        "name": "Hội Đâm Trâu",
        "dates": "Tháng 3",
        "description": "Lễ hội đâm trâu (người Ba Na gọi là x\u0027trǎng, người Cor gọi là xa-ố-piêu, người Gia Lai gọi là mnăm thu, người Lạch gọi là sa rơpu) là một lễ hội nhằm mục đích tế thần linh hoặc những người đã có công chủ trì thành lập buôn làng, ăn mừng chiến thắng, ăn mừng mùa màng bội thu hay ăn mừng các sự kiện quan trọng khác. Đây là một trong những lễ hội truyền thống của các dân tộc Tây Nguyên ở Việt Nam.",
        "dynasties": [],
        "events": []
    },
    {
        "name": "Hội Gióng",
        "dates": "9 tháng 4",
        "description": "Hội Gióng là một lễ hội truyền thống hàng năm ở nhiều nơi thuộc vùng Hà Nội để tưởng niệm và ca ngợi chiến công của người anh hùng truyền thuyết Thánh Gióng, một trong tứ bất tử của tín ngưỡng dân gian Việt Nam .",
        "dynasties": [],
        "events": []
    },
    {
        "name": "Hội Bà Chúa Xứ",
        "dates": "23 tháng 4 - 27 tháng 4",
        "description": "Lễ hội miếu Bà Chúa Xứ còn gọi lễ Vía Bà là một lễ hội của người dân Nam bộ, nằm dưới Núi Sam. Thành phố Châu Đốc, tỉnh An Giang, hàng năm đã thu hút trên 2 triệu lượt khách hành hương[1]",
        "dynasties": [],
        "events": []
    },
    {
        "name": "Hội Lăng Lê Văn Duyệt",
        "dates": "2 tháng 8",
        "description": "Lăng Lê Văn Duyệt (có tên chữ là Thượng Công miếu (chữ Hán: 上公廟, tục gọi là Lăng Ông) là khu đền và mộ của Tả quân Lê Văn Duyệt (1764-1832); hiện tọa lạc tại số 1 đường Vũ Tùng, có cổng Tây tại số 126 đường Lê Văn Duyệt, phường 1, quận Bình Thạnh, Thành phố Hồ Chí Minh, Việt Nam. Do vị trí Lăng Ông nằm ở khu vực Bà Chiểu nên người dân quen gọi chung Lăng Ông - Bà Chiểu (tức là \"Lăng Ông ở Bà Chiểu\") để chỉ khu vực này.",
        "dynasties": [],
        "events": []
    },
    {
        "name": "Hội Chọi Trâu Đồ Sơn",
        "dates": "9 tháng 8",
        "description": "Lễ hội chọi trâu Đồ Sơn, còn gọi là đấu ngưu , là một tập tục cổ, có từ xa xưa, một lễ hội truyền thống của người dân vạn chài tại vùng biển Đồ Sơn, Hải Phòng; diễn ra vào ngày 9 tháng 8 Âm lịch hàng năm; di sản văn hóa phi vật thể quốc gia năm 2013 của Việt Nam.[1][2] Đây là một lễ hội với lễ nghi trang trọng, rước kiệu thần, có lọng che, phường bát âm...[3].",
        "dynasties": [],
        "events": []
    },
    {
        "name": "Hội Nghinh Ông",
        "dates": "14 tháng 8 - 16 tháng 8",
        "description": "Lễ hội nghinh Ông là lễ hội cúng cá Ông của ngư dân các tỉnh miền ven biển Việt Nam từ Quảng Bình trở vào Nam (gồm cả Phú Quốc)[1]. Đây là lễ hội cầu ngư: cầu cho biển lặng gió hòa, ngư dân may mắn làm ăn phát đạt, an khang. Lễ hội nghinh Ông là loại lễ hội nước lớn nhất của ngư dân. Có nhiều tên gọi khác nhau như lễ rước cốt ông, lễ cầu ngư, lễ tế cá \"Ông\", lễ cúng \"Ông\", lễ nghinh \"Ông\", lễ nghinh ông Thủy tướng, nhưng tất cả đều có chung một quan niệm rằng cá \"Ông\" là sinh vật thiêng ở biển, là cứu tinh đối với những người đánh cá và làm nghề trên biển nói chung. Điều này đã trở thành một tín ngưỡng dân gian phổ biến trong các thế hệ ngư dân ở các địa phương nói trên. Ở mỗi địa phương, lễ hội nghinh Ông diễn ra vào một thời điểm khác nhau.",
        "dynasties": [],
        "events": []
    },
    {
        "name": "Hội Côn Sơn - Kiếp Bạc",
        "dates": "15 tháng 8 - 20 tháng 8",
        "description": "Đền Kiếp Bạc thuộc địa phận hai thôn Dược Sơn và Vạn Kiếp, xã Hưng Đạo, thành phố Chí Linh, tỉnh Hải Dương, Việt Nam; là nơi thờ phụng Hưng Đạo Đại Vương Trần Quốc Tuấn. Kiếp Bạc là tên ghép của hai vùng Vạn Yên (làng Kiếp) và Dược Sơn (làng Bạc). Đây là di tích quan trọng thuộc khu di tích Côn Sơn - Kiếp Bạc.",
        "dynasties": [],
        "events": []
    }
]