{"name":"Trần Hưng Đạo","description":"Trần Hưng Đạo còn được gọi là Hưng Đạo Vương, tên thật là Trần Quốc Tuấn, là con trai An Sinh Vương Trần Liễu, gọi vua Trần Thái Tông bằng chú ruột, và Công chúa Thụy Bà (chị ruột của vua Trần Thái Tông, và là cô ruột Trần Quốc Tuấn) là mẹ nuôi của ông, quê làng Tức Mặc, huyện Mỹ Lộc, tỉnh Hà Nam Ninh(nay thuộc tỉnh Nam Định).Ông có vốn tài quân sự, lại là tôn thất nhà Trần, do đó trong cả 3 lần quân Nguyên - Mông tấn công Đại Việt, ông đều được vua Trần cử làm tướng chống trận. Đặc biệt ở kháng chiến chống Nguyên - Mông lần thứ 2 và thứ 3, ông được vua Trần Nhân Tông phong làm Tiết chế các đạo quân thủy bộ. Dưới tài lãnh đạo của ông, quân dân Đại Việt chiến thắng ở Chương Dương, Hàm Tử, Vạn Kiếp, Bạch Đằng, đuổi giặc ra khỏi nước, được phong tước Hưng Đạo Vương. Sau đó, ông lui về ở Vạn Kiếp, là nơi ông được phong ấp (nay thuộc xã Hưng Đạo, thị xã Chí Linh, tỉnh Hải Dương). Nhân dân lúc bấy giờ kính trọng ông, lập đền thờ sống ông ở Vạn Kiếp. Tại đền có bài văn bia của vua Trần Thánh Tông, ví ông với Thượng phụ (tức Khương Tử Nha).\n\nTháng Sáu (âm lịch) năm Canh Tý (1300), ông lâm bệnh và mất ngày 20 tháng Tám (âm lịch) năm ấy, thọ khoảng 70 tuổi. Trần Hưng Đạo còn được gọi là Hưng Đạo Vương, tên thật là Trần Quốc Tuấn, là con trai An Sinh Vương Trần Liễu, gọi vua Trần Thái Tông bằng chú ruột, và Công chúa Thụy Bà (chị ruột của vua Trần Thái Tông, và là cô ruột Trần Quốc...Trần Thủ Độ là thái sư đầu triều nhà Trần, người có công sáng lập và là người thực tế nắm quyền lãnh đạo đất nước những năm đầu triều Trần, khoảng gần 40 năm, từ 1226 đến 1264. Trần Thủ Độ sinh tại làng Lưu Xá, huyện Hưng Hà,...Lý Chiêu Hoàng là vị vua thứ 9 và là cuối cùng của nhà Lý (Việt Nam) từ năm 1224 đến năm 1225, đồng thời là nữ hoàng duy nhất trong lịch sử Việt Nam. Lý Chiêu Hoàng còn có tên là Phật Kim, sinh vào tháng 9 Mậu...Trần Thái Tông tên thật là Trần Cảnh sinh ngày 16 tháng 6 năm Mậu Dần, niên hiệu Kiến Gia thứ 8 triều Lý (tức 10 tháng 7 năm 1218), ông là con của ông Trần Thừa và bà Lê Thị Phong. Ông là vị vua đầu tiên của...Trần Thị Dung vốn có tên là Trần Thị Ngừ, là người thôn Gia Lưu, Hải Ấp (nay là Làng Lưu Xá, xã Canh Tân, huyện Hưng Hà, tỉnh Thái Bình), là con gái của Trần Lý, em gái kế của Trần Thừa và Trần Tự Khánh, cô ruột của...Trần Quang Khải sinh năm 1241, mất năm 1294, là con trai thứ ba của vua Trần Thái Tông và hoàng hậu Thuận Thiên, em ruột vua Trần Thánh Tông. Thuở nhỏ, ông đã bộc lộ tư chất thông minh, giỏi cả văn lẫn võ, được vua cha rất mực...Chu Văn An còn được gọi là Chu An, Chu Văn Trinh, tự là Linh Triệt, hiệu là Tiều Ẩn, người thôn Văn, xã Quang Liệt, huyện Thanh Đàm (nay là Thanh Trì, Hà Nội). Là người chính trực, đã từng đỗ Thái học sinh nhưng không ra làm quan...Mạc Đĩnh Chi tên tự là Tiết Phu, người làng Lũng Động, huyện Chí Linh (nay thuộc xã Nam Tân, huyện Nam Sách, tỉnh Hải Dương). Năm 1304, ông đỗ Trạng nguyên. Vua thấy tướng mạo xấu có ý chê, ông dâng bài phú \"Ngọc tỉnh liên\" (sen giếng ngọc)...Trần Nhật Duật là con thứ 6 của Trần Thái Tông, sinh tháng 4 năm ất Mão (1255) tại hoàng cung Thăng Long. Ông là người có công trong cuộc kháng chiến chống quân Nguyên Mông lần thứ hai và thứ ba, giữ gìn bờ cõi nước Đại Việt. Sử...Trần Bình Trọng sinh năm 1259, là con trai của tướng Lê Trần và công chúa Chiêu Thánh. Ông là người có công lớn hộ giá bảo vệ cho hai vua Trần (Trần Thánh Tông và Trần Nhân Tông) trong cuộc kháng chiến chống quân Nguyên-Mông lần thứ hai. Ông...Hoài Văn hầu Trần Quốc Toản thuộc dòng dõi nhà vua và sinh vào năm Đinh Mão (1267). Ông là một quý tộc nhà Trần, sống ở thời kỳ trị vì của vua Trần Nhân Tông. Ông lớn lên trong không khí cả nước náo nức chuẩn bị chiến đấu...Trần Thánh Tông tên thật là Trần Hoảng, là con trai thứ, nhưng mà là con trưởng dòng đích của vua Trần Thái Tông và bà Hiển Từ Thuận Thiên Hoàng thái hậu Lý Thị. Ông sinh ngày 25 tháng Chín âm lịch năm Thiên Ứng Chính Bình thứ 9...Trần Nhân Tông tên thật là Trần Khâm là vị vua thứ ba của nhà Trần trong lịch sử Việt Nam. Ông là con trai trưởng của vua Trần Thánh Tông với Nguyên Thánh Thiên Cảm hoàng thái hậu Trần thị Thiều, sinh ngày 11 tháng 11 âm lịch năm...Trần Anh Tông tên thật là Trần Thuyên, ông là vị vua thứ tư của nhà Trần trong lịch sử Việt Nam. Trần Thuyên là con trưởng của Nhân Tông, mẹ là Bảo Thánh hoàng hậu, sinh ngày 17 tháng 9 năm 1276, được lập ngay làm Đông cung thái...Trần Minh Tông tên thật là Trần Mạnh, con thứ tư của Trần Anh Tông, mẹ là Chiêu Hiền hoàng thái hậu Trần Thị, con gái của Bảo Nghĩa đại vương Trần Bình Trọng, sinh năm Canh Tý 1300. Ông lên ngôi khi mới 14 tuổi, đổi niên hiệu...Nguyễn Trung Ngạn tự là Bang Trực, hiệu là Giới Hiên, người làng Thổ Hoàng, huyện Thiên Thi (nay là Ân Thi), tỉnh Hưng Yên. Nguyễn Trung Ngạn từ nhỏ đã thông minh xuất chúng, nổi tiếng thần đồng....Một trí thức tài hoa lỗi lạc như ông mà tài liệu về ông còn rất ít. \"Ðại Việt sủ ký toàn thư\" chép vắn tắt: \"Tháng ba năm Thiên Long thứ chín đời Trần Thánh Tông, khoa thi lấy Kinh trạng nguyên Trần Cố, Trại trạng nguyên Bạch Liêu....Tên thật là Lý Đạo Tái, người hương Vạn Tải, châu Nam Sách, lộ Lạng Giang. Nay là làng Thái Bảo, huyện Gia Bình, tỉnh Bắc Ninh. Học giỏi, đỗ cả thi hương, thi hội. Ông đỗ đệ nhất giáp tiến sĩ (trạng nguyên) khoa thi năm 1272 hay 1274...Nguyễn Hiền đỗ trạng nguyên khi 13 tuổi. Ông là người làng Dương A, huyện Thượng Hiền, phủ Thiên Trường(nay là xã Nam Thắng, huyện Nam Trực, tỉnh Nam Định). Ông thi đỗ trạng nguyên khi mới 12 tuổi, trở thành trạng nguyên trẻ nhất trong lịch sử khoa cử...Phạm Ngũ Lão sinh năm 1255 tại làng Phù Ủng (nay thuộc huyện Ân Thi, tỉnh Hưng Yên) đúng vào lúc vương triều Trần đang động viên sức dân cả nước chuẩn bị cho cuộc chiến đấu chống giặc Nguyên - Mông lần thứ 2. Ông vừa là môn...Tức Nguyên Từ quốc mẫu của nhà Trần, họ Trần, húy có lẽ là Anh, vợ Hưng Đạo vương Trần Quốc Tuấn....Lê Văn Hưu (1230-1322) người làng Phủ Lý, huyện Đông Sơn, tỉnh Thanh Hóa (nay thuộc xã Triệu Trung, huyện Thiệu Hóa, tỉnh Thanh Hóa)....Đoàn Nhữ Hài người làng Hội Xuyên, huyện Trường Tân, lộ Hồng Châu (nay là huyện Gia Lộc, tỉnh Hải Dương), là một danh thần đời nhà Trần. Ông làm quan trải ba đời vua Trần Anh Tông (1293-1214), Trần Minh Tông (1314-1329) và Trần Hiến Tông (1329-1341), là người...Công chúa Huyền Trân (1287 – 1340), con gái vua Trần Nhân Tông và hoàng hậu Thiên Cảm, hạ giá lấy vua nước Champa Chế Mân. Chính nhờ cuộc hôn nhân này một mặt làm cho mối quan hệ giao bang Đại Việt – Chăm pa trở nên thân thiết...Hưng Nhượng vương Trần Quốc Tảng một vị tướng và là con trai thứ ba của Hưng Đạo đại vương Trần Quốc Tuấn và Nguyên Từ Quốc Mẫu tức công chúa Thiên Thành. Có lần khuyên cha cướp ngôi báu, Trần Quốc Tảng bị Trần Hưng Đạo rút gươm toan...","dates":"1228 - 1300"}