[
    {
        "name": "Trần Hưng Đạo",
        "description": "Trần Hưng Đạo còn được gọi là Hưng Đạo Vương, tên thật là Trần Quốc Tuấn, là con trai An Sinh Vương Trần Liễu, gọi vua Trần Thái Tông bằng chú ruột, và Công chúa Thụy Bà (chị ruột của vua Trần Thái Tông, và là cô ruột Trần Quốc Tuấn) là mẹ nuôi của ông, quê làng Tức Mặc, huyện Mỹ Lộc, tỉnh Hà Nam Ninh(nay thuộc tỉnh Nam Định).Ông có vốn tài quân sự, lại là tôn thất nhà Trần, do đó trong cả 3 lần quân Nguyên - Mông tấn công Đại Việt, ông đều được vua Trần cử làm tướng chống trận. Đặc biệt ở kháng chiến chống Nguyên - Mông lần thứ 2 và thứ 3, ông được vua Trần Nhân Tông phong làm Tiết chế các đạo quân thủy bộ. Dưới tài lãnh đạo của ông, quân dân Đại Việt chiến thắng ở Chương Dương, Hàm Tử, Vạn Kiếp, Bạch Đằng, đuổi giặc ra khỏi nước, được phong tước Hưng Đạo Vương. Sau đó, ông lui về ở Vạn Kiếp, là nơi ông được phong ấp (nay thuộc xã Hưng Đạo, thị xã Chí Linh, tỉnh Hải Dương). Nhân dân lúc bấy giờ kính trọng ông, lập đền thờ sống ông ở Vạn Kiếp. Tại đền có bài văn bia của vua Trần Thánh Tông, ví ông với Thượng phụ (tức Khương Tử Nha).\n\nTháng Sáu (âm lịch) năm Canh Tý (1300), ông lâm bệnh và mất ngày 20 tháng Tám (âm lịch) năm ấy, thọ khoảng 70 tuổi.",
        "dates": "1228 - 1300"
    },
    {
        "name": "Nguyễn Hữu Cảnh",
        "description": "Nguyễn Hữu Cảnh 1650-1700 tên thật là Nguyễn Hữu Thành, húy Kính, tộc danh là Lễ, là một danh tướng thời chúa Nguyễn Phúc Chu. Ông được xem là người xác lập chủ quyền cho người Việt tại vùng đất Sài Gòn-Gia Định vào năm 1698.Nguyễn Hữu Cảnh là cháu 9 đời của Nguyễn Trãi. Ông nội của ông là Nguyễn Triều Văn (dòng Nguyễn Hữu, tước Triều Văn hầu, phò triều Lê và Nguyễn sơ), trước ở làng Gia Miêu, huyện Tống Sơn, tỉnh Thanh Hóa, sau theo chúa Tiên (Nguyễn Hoàng) di cư vào đất Thuận Hóa.\n\nCon ông Triều Văn là Nguyễn Hữu Dật sinh nhiều con trai, trong đó có bốn người là tướng giỏi, kể theo thứ tự: Nguyễn Hữu Hào (tước Hào Lương hầu, tác giả truyện nôm Song tinh bất dạ), Nguyễn Hữu Trung (tước Trung Thắng hầu), Nguyễn Hữu Cảnh (tước Lễ Thành hầu) và Nguyễn Hữu Tín (tước Tín Đức hầu).\n\nDòng dõi con nhà tướng, lớn lên trong thời kỳ Trịnh-Nguyễn phân tranh, lại chuyên tâm luyện tập võ nghệ. Bởi vậy, tuy còn trẻ, nhưng ông đã lập được nhiều chiến công và đã được chúa Nguyễn Phúc Tần phong chức Cai cơ (một chức võ quan thuộc bậc cao) vào lúc tuổi độ hai mươi, được người đương thời gọi tôn là \"Hắc Hổ\" (vì ông sinh năm Dần và vì có nước da ngăm đen, vóc dáng hùng dũng).",
        "dates": "1650 - 1700"
    },
    {
        "name": "Trần Thủ Độ",
        "description": "Trần Thủ Độ là thái sư đầu triều nhà Trần, người có công sáng lập và là người thực tế nắm quyền lãnh đạo đất nước những năm đầu triều Trần, khoảng gần 40 năm, từ 1226 đến 1264. Trần Thủ Độ sinh tại làng Lưu Xá, huyện Hưng Hà, tỉnh Thái Bình, Việt Nam. Đánh giá về Trần Thủ Độ, có nhiều luồng dư luận trái chiều, ông là người có công sáng lập nhà Trần, ý kiến khác lại cho rằng ông là người đáng chê trách khi giết hại vua nhà Lý.Sau khi Trần Tự Khánh chết (1223), Trần Thủ Độ thực sự là người thay thế nắm quyền trong triều. Ông là người đã ép Huệ Tông nhường ngôi cho con gái mới lên 7 tuổi là Chiêu Thánh Công Chúa, tức Lý Chiêu Hoàng. Sau đó ông đưa con Trần Thừa là Trần Cảnh, mới 8 tuổi, vào hầu Lý Chiêu Hoàng, rồi dàn xếp để Trần Cảnh lấy Lý Chiêu Hoàng và nhường ngôi cho Trần Cảnh vào cuối năm 1225. Để củng cố quyền lực nhà Trần, Thủ Độ rắp tâm diệt cỏ tận gốc đối với tôn thất nhà Lý. Năm 1225, Thủ Độ ép Huệ Tông phải tự tử.\n\nXét về mặt khác, Trần Thủ Độ lại là người có công lớn không chỉ với nhà Trần mà còn với cả non sông, dất nước. Kể từ thời Lý Cao Tông, triều đình bắt đầu lâm cảnh suy tàn, vua mải ăn chơi bỏ bê chính sự, loạn lạc khắp nơi nổi lên, kinh tế suy sụp. Sau khi nhà Trần được lập, vua Trần Thái Tông chỉ là cậu bé chưa đầy 10 tuổi. Chính Trần Thủ Độ đã ngược xuôi dẹp nội loạn, đưa đất nước từ loạn đến trị. Ông cũng đã lèo lái hệ thống chính quyền khôi phục kinh tế, định lại thuế khóa, xây dựng đê điều, mở rộng chế độ tư hữu ruộng đất, xây dựng và củng cố quân đội, chăm lo học hành…",
        "dates": "1194 - 1264"
    },
    {
        "name": "Hồ Quý Ly",
        "description": "Tổ tiên Hồ Quý Ly là Hồ Hưng Dật vốn người Chiết Giang (Trung Quốc), sang làm Thái thú Diễn Châu và định cư ở hương Bào Đột, nay là xã Quỳnh Lâm, huyện Quỳnh Lưu, tỉnh Nghệ An. Hồ Liêm là đời cháu thứ 12 đã dời đến ở hương Đại Lại, Thanh Hóa, làm con nuôi tuyên úy Lê Huấn, từ đấy lấy Lê làm họ mình. Hồ Quý Ly là cháu bốn đời của cụ Hồ Liêm.Hồ Quý Ly có hai người cô đều được vua Trần Minh Tông lấy làm cung phi và đều trở thành mẹ hai vua nhà Trần, nhờ đó ông rất được vua Trần trọng dụng, sớm được đưa vào làm quan, ông còn được vua Trần gả công chúa Nhất Chi Mai và nắm giữ chức vụ cao nhất trong triều đình.\n\nSau khi Hồ Quý ly bức vua Trần dời đô từ Thăng Long vào Tây Đô (Thanh Hóa) và giết hàng loạt quần thần trung thành với nhà Trần, tháng 2 năm Canh Thìn 1400, ông đă truất ngôi của Trần Thiếu Đế, tự lên làm vua lấy quốc hiệu là Đại Ngu, lập nên nhà Hồ. Tuy nhiên năm 1407 ông đã bị quân Minh bắt, Vương triều Hồ và nước Đại Ngu sụp đổ.\n\n\nHồ Quý Ly vừa bị coi là kẻ nghịch thần chiếm ngôi, đại gian đại ác, nhưng xét theo mặt khác, ông lại là nhà cải cách, nhà chính trị tài giỏi. Ông là người đã cho phát hành và lưu thông tiền giấy lần đầu tiên trong lịch sử Việt Nam.",
        "dates": "1336 - 1407"
    },
    {
        "name": "Hùng Vương",
        "description": "Sử cũ viết, vào thế kỉ VII TCN, ở vùng Gia Ninh (Phú Thọ), có vị thủ lĩnh tài năng đã khuất phục được các bộ lạc và tự xưng là Hùng Vương, đóng đô ở Bạch Hạc (Phú Thọ), đặt tên nước Văn Lang.\n\nTheo bộ sử khác viết về sự tích Âu cơ - Lạc Long Quân, thì những người con theo mẹ Âu Cơ lên vùng cao đã tôn người anh cả lên làm vua, hiệu là Hùng Vương, đặt tên nước là Văn Lang.Hùng Vương giữ mọi quyền hành trong nước, đặt tướng văn là Lạc hầu, tướng võ là Lạc tướng. Con trai vua là Quan lang, con gái vua là Mị nương. Đời đời cha truyền con nối đều gọi là Hùng Vương.\n\nTừ thời Kinh Dương Vương (2879 TCN) cho đến hết thời Hùng Vương (năm 258 TCN) kéo dài 2.622 năm và tất cả có 18 vị vua Hùng. Đến năm 258 TCN nhà nước Văn Lang bị Thục Phán (tức An Dương Vương) thôn tính, chấm dứt thời Hùng Vương.",
        "dates": ""
    },
    {
        "name": "An Dương Vương",
        "description": "An Dương Vương tên thật là Thục Phán xưng vua năm 257 trước Công Nguyên, lập nên nước Âu Lạc, đóng đô ở thành Cổ Loa. Thời An Dương Vương (257 TCN - 207 TCN) là thời kỳ nối tiếp thời Hồng Bàng của 18 đời Vua Hùng.Năm 218 TCN, Tần Thủy Hoàng sai quân đánh xuống phương Nam, tiến sâu vào vùng Bắc Văn Lang, nơi người Lạc Việt cùng sống với người Tây Âu, giết người thủ lĩnh Tây Âu. Thục Phán được đưa lên làm tướng để đánh quân Tần. Sau khi đánh thắng quân Tần, Thục phán đã buộc vua Hùng phải nhường ngôi cho mình.\n\nÔng tự xưng là An Dương Vương, đóng đô ở Phong Khuê (nay là vùng Cổ Loa, huyện Đông Anh - Hà Nội). Ông cho xây dựng thành Cổ Loa rộng hơn nghìn trượng như hình trôn ốc.\n\nTuy nhiên, sau này An Dương Vương mắc kế của Triệu Đà, một vị tướng của nhà Tần. An Dương Vương bị thất bại, phải bỏ chạy và tự tử. Âu Lạc rơi vào ách đô hộ của nhà Triệu, kết thúc thời kỳ An Dương Vương.",
        "dates": ""
    },
    {
        "name": "Hai Bà Trưng",
        "description": "Hai Bà Trưng là Trưng Trắc và Trưng Nhị ở huyện Mê Linh (vùng đất từ ba Vì đến Tam Đảo, nay thuộc Hà Nội, Vĩnh Phúc) là con gái Lạc tướng thuộc dòng dõi Hùng Vương. Chồng bà Trưng Trắc là Thi Sách, con trai Lạc tướng huyện Chu Diên (vùng Đan Phượng và Từ Liêm - Hà Nội).Hai gia đình Lạc tướng cùng mưu việc lớn. Họ bí mật tìm cách liên kết với các thủ lĩnh ở mọi miền đất nước để chuẩn bị nổi dậy. Không may, Thi Sách bị quân Hán giết chết.\n\nĐể đòi nợ nước, trả thù nhà Hai Bà Trưng khởi binh chống lại quân Hán, lập ra một quốc gia với kinh đô tại Mê Linh và tự phong là Nữ vương.\n\nNăm 42-43 vua Hán sai Mã Viện chỉ huy đạo quân sang xâm lược nước ta, mặc dù cuộc khởi nghĩa chống lại quân xâm lược bị thất bại nhưng Hai Bà Trưng vẫn được xem là những bậc nữ nhi hào kiệt hiếm có trong lịch sử và được coi là anh hùng dân tộc của Việt Nam.\n\nHai bà được thờ cúng tại nhiều đền thờ, trong đó lớn nhất là Đền Hai Bà Trưng ở quận Hai Bà Trưng, Hà Nội và đền Hai Bà Trưng tại thôn Hạ Lôi, xã Mê Linh, huyện Mê Linh,Vĩnh Phúc nay là Mê Linh,Hà Nội - quê hương của hai bà.",
        "dates": "? - 43"
    },
    {
        "name": "Bà Triệu",
        "description": "Bà Triệu có tên là Triệu Thị Trinh, thuở nhỏ ba mẹ đều mất sớm, là em gái của Triệu Quốc Đạt - một hào trưởng lớn ở miền núi huyện Quan yên, thuộc quận Cửu Chân (huyện Yên Định, Thanh Hóa), bà là người có sức khỏe, có chí lớn và giàu mưu chí. Năm 19 tuổi, bà đã cùng anh trai tập hợp nhiều nghĩa sĩ trên đỉnh núi Nưa, mài gươm luyện võ, chuẩn bị khởi nghĩa.Sau khi Triệu Quốc Đạt lâm bệnh qua đời. Các nghĩa binh tôn bà lên làm chủ. Khi ra trận, Bà mặc áo giáp vàng, đi guốc ngà, cài trâm vàng, cưỡi voi và được tôn là Nhụy Kiều tướng quân.\n\nSau khi cuộc khởi nghĩa chống lại quân Ngô bị đàn áp, bà Triệu hi sinh trên núi Tùng (Phú Điền - Hậu Lộc - Thanh Hóa). Ở đây hiện vẫn còn lăng mộ Bà.",
        "dates": "226 - 248"
    },
    {
        "name": "Lý Nam Đế",
        "description": "Lý Nam Đế là vị hoàng đế sáng lập nhà Tiền Lý và khai sinh nhà nước Vạn Xuân trong lịch sử Việt Nam, ông tên thật là Lý Bí (còn gọi là Lý Bôn), quê ở Thái Bình (mạn bắc Sơn tây). Tổ tiên của ông là người Trung Quốc, vào cuối thời Tây Hán thì tránh sang ở Việt Nam (lúc đó đang là thuộc địa của Trung Quốc) để trốn nạn binh đao. Qua 7 đời, đến đời Lý Bí thì dòng họ Lý đã ở Việt Nam được hơn 5 thế kỷ.Từ nhỏ, Lý Bí đã tỏ ra là một cậu bé thông minh, sớm hiểu biết. Khi Lý Bí 5 tuổi thì cha mất, 7 tuổi thì mẹ qua đời. Ông đến ở với chú ruột. Một hôm, có một vị Pháp tổ thiền sư đi ngang qua, trông thấy Lý Bí khôi ngô, tuấn tú liền xin đem về chùa nuôi dạy. Sau hơn 10 năm rèn sách chuyên cần, Lý Bí trở thành người học rộng, hiểu sâu. Nhờ có tài văn võ kiêm toàn, ông được tôn lên làm thủ lĩnh địa phương. Có thời gian ông được cử giữ chức chỉ huy quân đội ở Đức Châu (nam Nghệ An - Hà Tĩnh). Một thời gian ngắn sau, vì căm ghét bọn đô hộ, ông đã từ quan về quê, ngấm ngầm liên lạc với các hào kiệt trong vùng để chuẩn bị nổi dậy.\n\nSau khi chiến thắng quân Lương và đánh tan quân Lâm Ấp, Lý Bí lên ngôi hoàng đế (Lý Nam Đế), đặt tên nước là Vạn Xuân, dựng kinh đô ở vùng cửa sông Tô Lịch (Hà Nội), đặt niên hiệu là Thiên Đức.\n\nNăm 548, Lý Nam Đế bị nhiễm lam chướng, ốm qua đời, thọ 46 tuổi.",
        "dates": "503 - 548"
    },
    {
        "name": "Triệu Việt Vương",
        "description": "Triệu Việt Vương tên thật là Triệu Quang Phục, người có công kế tục Lý Nam Đế đánh đuổi quân xâm lược nhà Lương, giữ nền độc lập cho nước Vạn Xuân, và là vua Việt Nam cai trị từ năm 548 đến năm 571.Triệu Quang Phục là con Triệu Túc, người huyện Chu Diên một thủ lĩnh địa phương có lòng yêu nước không chịu khuất phục nhà Lương. Ông cùng cha theo Lý Nam Đế khởi nghĩa từ ngày đầu, có công lao đánh đuổi quân Lương về nước, được Lý Bí rất tin cậy và trao chức tả tướng quân nước Vạn Xuân.\n\nSau thất bại ở hồ Điển Triệt, ông được Lý Nam Đế trao quyền chỉ huy chống quân Lương. Ông đã đánh bại được quân Lương và lên ngôi vua lấy hiệu là Triệu Việt Vương. 20 năm sau, Lý Phật Tử từ phía nam kéo quân về cướp ngôi, Triệu Việt Vương bị thua trận, ông tự tử ở cửa sông Đáy, kết thúc triều đại của mình.\n\n\nNgười đời sau lập đền thờ ông ở nhiều nơi, tập trung chủ yếu ở vùng ven biển 2 tỉnh Ninh Bình và Nam Định.",
        "dates": "? - 571"
    },
    {
        "name": "Mai Hắc Đế",
        "description": "Mai Hắc Đế tên thật là Mai Thúc Loan, ông là một anh hùng dân tộc, là người lãnh đạo cuộc khởi nghĩa nông dân chống lại quân nhà Đường, sau khi lên ngôi vua ông lấy hiệu là Hắc Đế.Mai Thúc Loan là người làng Mai Phụ (cón có tên là Kẻ Mỏm), một làng làm muối ở cửa biển Thạch Hà (huyện Thạch Hà, tỉnh Hà Tĩnh). Bố Mai Thúc Loan là Mai Hoàn, mẹ là Mai An Hòa nguyên gốc Lộc Hà - Hà Tĩnh, sau mẹ ông đưa con sang sống ở Ngọc Trừng (huyện Nam Đàn, tỉnh Nghệ An). Ngay từ nhỏ ông đã phải kiếm củi, chăn trâu, cày ruộng cho nhà giàu nhưng ông học rất giỏi và có chí lớn.\n\nKhoảng cuối những năm 10, thế kỉ VIII ông kêu gọi những người dân phu bỏ về quê, mộ binh nổi dậy. Ông cũng kết thân vôi nhiều hào kiệt, tướng tài. Sau cuộc khởi nghĩa Hoan Châu, ông chọn vùng Sa Nam (Nam Đàn) xây dựng căn cứ. Ông xưng đế, lấy hiệu là Hắc Đế vào năm 713.",
        "dates": "? - 722"
    },
    {
        "name": "Phùng Hưng",
        "description": "Phùng Hưng xuất thân từ dòng dõi cự tộc lâu đời ở đất Đường Lâm, nay là xã Đường Lâm, Sơn Tây, Hà Nội. Ông là cháu 7 đời của Phùng Tói Cái, quan lang Đường Lâm. Cha của Phùng Hưng là Phùng Hạp Khanh, một người hiền tài đức độ. Phùng Hưng là người rất khỏe, có sức vật nổi trâu, đánh được hổ, ông cũng là người giàu lòng thương người hay giúp đỡ người nghèo khổ. Nhân dân trong vùng ai cũng mến phục.Ông là người anh hùng đã đánh chiếm lại thành Tống Bình (Hà Nội), và xây dựng nền tự chủ trong khoảng gần chục năm. Sau khi ông mất, con trai ông là Phùng An nối nghiệp cha, dâng tôn hiệu cha là Bố Cái Đại Vương.\n\nHiện nay, lăng mộ của ông còn lại ở đầu phố Giảng Võ, quận Ba Đình, Hà Nội. Để tưởng nhớ người anh hùng dân tộc, Nhà nước ta đã đặt tên phố Phùng Hưng tại phía cửa Đông của thủ đô Hà Nội.",
        "dates": "761 - 802"
    },
    {
        "name": "Khúc Thừa Dụ",
        "description": "Khúc Thừa Dụ quê ở Hồng Châu (Ninh Giang, Hải Dương), thuộc một dòng họ lớn lâu đời. Ông sống khoan hòa, hay thương người, được dân chúng mến phục. Ông là người đã đặt nền móng khôi phục nền tự chủ cho dân tộc Việt sau hơn một nghin năm Bắc thuộc. Ông được xem là người mở đầu cho chính sách ngoại giao khôn khéo của người Việt đối với triều đình phương Bắc.Ngày 23 tháng 7 năm 907, Khúc Thừa Dụ mất sau hai năm làm Tiết độ sứ. Con ông là Khúc Hạo lên kế vị. Dù ông không xưng vương xưng đế, nhưng đời sau nhớ ơn và gọi ông là Khúc Tiên chủ.",
        "dates": "? - 907"
    },
    {
        "name": "Khúc Hạo",
        "description": "Khúc Hạo còn gọi là Khúc Thừa Hạo là con của Khúc Thừa Dụ. Vào năm Đinh Mão 907 Khúc Thừa Dụ qua đời, Khúc Hạo thay cha làm Tiết độ sứ, ông hết lòng chăm lo việc dân nước. Ông quê ở Hồng Châu (Ninh Giang, Hải Dương).Ông đã tiến hành cải cách và xây dựng đất nước tự chủ theo đường lối: “Chính sự cốt chuộng khoan dung, giản dị, nhân dân đều được yên vui”. Ông đã sửa lại chế độ điền tô, xem xét và định lại mức thuế. Ông ra lệnh “bình quân thuế ruộng, tha bỏ lực dịch, lập sổ hộ khẩu, kê rõ quê quán, giao cho giáp trưởng trông coi”\n\nKhúc Hạo mất năm 917, con là Khúc Thừa Mỹ lên thay. Dù ông chưa từng xưng đế hay xưng vương nhưng đời sau nhớ công lao của ông và gọi ông là ‘‘Khúc Trung chủ’’.",
        "dates": "? - 917"
    },
    {
        "name": "Khúc Thừa Mĩ",
        "description": "Khúc Thừa Mĩ là con Khúc Hạo, thay cha làm Tiết độ sứ từ năm Đinh Sửu 917. Ông là người làng Cúc Bồ đất Hồng Châu (Ninh Giang, Hải Dương).Trong thời gian cầm quyền, Khúc Thừa Mĩ đã sai lầm trong cả chính sách đối nội lẫn đối ngoại, ông mất sự ủng hộ của nhân dân trong nước, trong thời gian đó nhà Hậu Lương cũng không thể hỗ trợ được gì, Khúc Thừa Mĩ đơn độc và bị thua trận. Ông bị quân Nam Hán bắt đưa về Phiên Ngung. Dù ông không có đóng góp gì đáng kể nhưng đời sau nhớ ơn công lao của ông và cha Khúc Thừa Mĩ nên vẫn tôn ông là “Khúc Hậu chủ”.",
        "dates": ""
    },
    {
        "name": "Dương Đình Nghệ",
        "description": "Dương Đình Nghệ có sách chép là Dương Diên Nghệ là là một trong những bộ tướng của Khúc Thừa Hạo. Ông hết lòng giúp họ Khúc chăm dân trị nước. Sau khi Khúc Hạo mất, ông tiếp tục làm bộ tướng cho Khúc Thừa Mỹ. Ông quê ở làng Giàng (Thiệu Dương, Thiệu Hóa, Thanh Hóa), từng là một hào trưởng ở Ái Châu (Thanh Hóa). Ông là người thuộc dòng họ lớn, ông nuôi 3000 \"con nuôi\" đều lấy họ Dương.Khi nghe tin Khúc Thừa Mỹ bị bắt, ông đã đem quân từ Thanh Hóa ra Bắc bao vây, tấn công thành Tống Bình. Sau khi đánh tan quân Nam Hán, Dương Đình Nghệ tự xưng là Tiết độ sứ, tiếp tục xây dựng nền tự chù.",
        "dates": "? - 937"
    },
    {
        "name": "Kiều Công Tiễn",
        "description": "Kiều Công Tiễn, vốn là danh tướng được tin cậy của Dương Đình Nghệ, là hào trưởng Phong Châu (Phú Thọ). Tuy nhiên sau đó Kiều Công Tiễn đã đắc ý sinh kiêu, âm mưu phản nghịch đã giết chết Dương Đình Nghệ, nắm lấy binh quyền, tự xưng là Tiết độ sứ.Kiều Công Tiễn sợ bị Ngô Quyền trả thù nên năm 938 cho người sang cầu cứu quân Nam Hán mở đường cho quân Nam Hán sang xâm lược nước ta lần thứ hai.",
        "dates": "? - 938"
    },
    {
        "name": "Ngô Quyền",
        "description": "Ngô Quyền còn được biết đến với tên gọi Tiền Ngô Vương là vị vua đầu tiên của nhà Ngô trong lịch sử Việt Nam. Ông là người lãnh đạo nhân dân đánh bại quân Nam Hán trong trận Bạch Đằng, kết thúc 1.000 năm Bắc thuộc của Việt Nam.\n\nNgô Quyền là người Đường Lâm (Sơn Tây, Hà Nội), cha là Ngô Mân, làm châu mục Đường Lâm. Ông là người có sức khỏe, chí lớn, mưu cao, có nhiều công lao được Dương Đình Nghệ tin tưởng và gả con gái cho.Sau khi đánh đuổi quân Nam Hán, Ngô Quyền được Dương Đình Nghệ phong làm Thứ sử, trấn giữ Ái Châu (Thanh Hóa).\n\nSau khi Kiều Công Tiễn sát hại Dương Đình Nghệ để đoạt chức và mở đường cho quân Nam Hán sang xâm lược. Ngô Quyền nhanh chóng tập hợp lực lượng, kéo quân ra Bắc, giết chết Kiều Công Tiễn rồi chuẩn bị quyết chiến với quân Nam Hán. Thắng lợi vang rội của Ngô Quyền trên sông Bạch Đằng vào năm 938 đã đặt dấu chấm hết cho mọi âm mưu xâm lược của quân Nam Hán, đồng thời cũng kết thúc thời kì Bắc thuộc của Việt Nam.\n\n\nMùa xuân năm 939, ông xưng là Ngô vương, đóng đô ở Cổ Loa (thuộc Hà Nội ngày nay). Năm 944, Ngô Vương qua đời, hưởng dương 47 tuổi.\n\nĐể nhớ công ơn của ông, đền thờ của ông được xây ở nhiều nơi trong đó đền thờ và lăng ở Đường Lâm là một địa chỉ du lịch và tâm linh nổi tiếng. Tên ông cũng được đặt cho một con phố ở Hà Nội và ở thành phố Thanh Hóa, một quận nội thành của Hải Phòng. Nhiều trường học ở Việt Nam cũng mang tên Ngô Quyền.",
        "dates": "898 - 944"
    },
    {
        "name": "Dương Tam Kha",
        "description": "Dương Tam Kha là con của Dương Đình Nghệ, là người làng Dương Xá, huyện Đông Sơn.\n\nNăm Giáp Thìn 944, Ngô Quyền mất, hai con Ngô Xương Ngập và Ngô Xương Văn còn trẻ, không đủ uy tín và sức mạnh để giữ vững chính quyền, Dương Tam Kha được Ngô Vương ủy thác phù tá con lớn là Ngô Xương Ngập, nhưng ông thừa dịp đoạt lấy quyền của cháu, tự xưng Bình Vương.Năm 950, Dương Tam Kha sai Ngô Xương Văn đi dẹp loạn tại hai thôn ở Thái Bình thì bị Ngô Xương Văn quay trở về đánh úp lấy lại nước, xưng là Nam Tấn vương. Xét thấy Dương Tam Kha có nhiều công trạng nên Ngô Xương Văn giáng xuống làm Trương Dương công và ban cho bổng lộc một vùng đất ở phía nam thành Cổ Loa. Tại đây, ông đã dày công cải tạo vùng đất hoang hóa thành vùng quê sầm uất đặt tên là Chương Dương (nay là xã Chương Dương, huyện Thường Tín, tỉnh Hà Tây). Sau đó, ông lại đưa con cháu rời về phía nam để tiếp tục khai phá những vùng đất mới.",
        "dates": ""
    },
    {
        "name": "Ngô Xương Văn",
        "description": "Ngô Xương Văn con thứ hai của Ngô Quyền, mẹ là hoàng hậu họ Dương. Ông là một vị vua nhà Ngô, trị vì từ 950 đến 965. Trong đó khoảng 951 – 954 cùng trị vì đất nước với anh trai là Ngô Xương Ngập.Ngô Quyền mất, Xương Văn bị cậu là Dương Tam Kha cướp quyền và bắt ông làm con nuôi. Các phe nổi dậy ở khắp nơi, đất nước lâm vào tình trạng không ổn định. Năm 950, nhân hai thôn Thái Bình (thuộc tỉnh Sơn Tây) nổi loạn, ông vâng lệnh Tam Kha điều binh cùng hai tướng Dương Kiết Lợi và Đỗ Cảnh Thạch đi đánh dẹp. Đến Từ Liêm, ông hợp bàn mưu kế với hai tướng ấy, rồi trở về lật đổ Tam Kha, giành lại ngôi vua, tự xưng làm Nam Tấn Vương, đóng đô ở Cổ Loa. Ông mời anh về cùng nhau trông coi việc nước. Song, do mâu thuẫn nội bộ, uy tín nhà Ngô giảm sút.",
        "dates": "? - 965"
    }
]